Тест/Тест/src/Catalogs/ФОТ/ФОТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФОТ</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>КоличествоСотрудников</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>50</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗПФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>50</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкладФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>50</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МотивацияФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>50</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СредняяЗППлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>50</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкладПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>50</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МотивацияПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>50</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НижнийУровеньЗП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>50</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СреднийУровеньЗП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>50</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерхнийУровеньЗП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>50</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимРаботы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Тест/Тест/src/Catalogs/ФОТ/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

Родитель = Объект.Родитель;
Пока НЕ Родитель = Справочники.ФОТ.ПустаяСсылка() Цикл
	
	
	РодительОбъект = Родитель.ПолучитьОбъект();

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ФОТ.СредняяЗПФакт), 0) КАК СредняяЗПФакт,
		|	ЕСТЬNULL(СУММА(ФОТ.ОкладФакт), 0) КАК ОкладФакт,
		|	ЕСТЬNULL(СУММА(ФОТ.МотивацияФакт), 0) КАК МотивацияФакт,
		|	ЕСТЬNULL(СУММА(ФОТ.СредняяЗППлан), 0) КАК СредняяЗППлан,
		|	ЕСТЬNULL(СУММА(ФОТ.ОкладПлан), 0) КАК ОкладПлан,
		|	ЕСТЬNULL(СУММА(ФОТ.МотивацияПлан), 0) КАК МотивацияПлан,
		|	ЕСТЬNULL(СУММА(ФОТ.НижнийУровеньЗП), 0) КАК НижнийУровеньЗП,
		|	ЕСТЬNULL(СУММА(ФОТ.СреднийУровеньЗП), 0) КАК СреднийУровеньЗП,
		|	ЕСТЬNULL(СУММА(ФОТ.ВерхнийУровеньЗП), 0) КАК ВерхнийУровеньЗП,
		|	ЕСТЬNULL(СУММА(ФОТ.КоличествоСотрудников), 0) КАК КоличествоСотрудников
		|ИЗ
		|	Справочник.ФОТ КАК ФОТ
		|ГДЕ
		|	ФОТ.Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Родитель", Родитель);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	РезультатЗапроса.Следующий();
	
	РодительОбъект.ЗПФакт = РезультатЗапроса.СредняяЗПФакт;
	РодительОбъект.ОкладФакт = РезультатЗапроса.ОкладФакт;
	РодительОбъект.МотивацияФакт = РезультатЗапроса.МотивацияФакт;
	РодительОбъект.СредняяЗППлан = РезультатЗапроса.СредняяЗППлан;
	РодительОбъект.ОкладПлан = РезультатЗапроса.ОкладПлан;
	РодительОбъект.МотивацияПлан = РезультатЗапроса.МотивацияПлан;
	РодительОбъект.НижнийУровеньЗП = РезультатЗапроса.НижнийУровеньЗП;
	РодительОбъект.СреднийУровеньЗП = РезультатЗапроса.СреднийУровеньЗП;
	РодительОбъект.ВерхнийУровеньЗП = РезультатЗапроса.ВерхнийУровеньЗП;
	РодительОбъект.КоличествоСотрудников = РезультатЗапроса.КоличествоСотрудников;
	
	Родитель = РодительОбъект.Родитель;
	
	РодительОбъект.Записать();
	
КонецЦикла
	
//Если НЕ Объект.Родитель = Справочники.ФОТ.ПустаяСсылка() Тогда
//	
//	
//	РодительОбъект = Объект.Родитель.ПолучитьОбъект();
//
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//		"ВЫБРАТЬ
//		|	ЕСТЬNULL(СУММА(ФОТ.СредняяЗПФакт), 0) КАК СредняяЗПФакт,
//		|	ЕСТЬNULL(СУММА(ФОТ.ОкладФакт), 0) КАК ОкладФакт,
//		|	ЕСТЬNULL(СУММА(ФОТ.МотивацияФакт), 0) КАК МотивацияФакт,
//		|	ЕСТЬNULL(СУММА(ФОТ.СредняяЗППлан), 0) КАК СредняяЗППлан,
//		|	ЕСТЬNULL(СУММА(ФОТ.ОкладПлан), 0) КАК ОкладПлан,
//		|	ЕСТЬNULL(СУММА(ФОТ.МотивацияПлан), 0) КАК МотивацияПлан,
//		|	ЕСТЬNULL(СУММА(ФОТ.НижнийУровеньЗП), 0) КАК НижнийУровеньЗП,
//		|	ЕСТЬNULL(СУММА(ФОТ.СреднийУровеньЗП), 0) КАК СреднийУровеньЗП,
//		|	ЕСТЬNULL(СУММА(ФОТ.ВерхнийУровеньЗП), 0) КАК ВерхнийУровеньЗП
//		|ИЗ
//		|	Справочник.ФОТ КАК ФОТ
//		|ГДЕ
//		|	ФОТ.Родитель = &Родитель";
//	
//	Запрос.УстановитьПараметр("Родитель", Объект.Родитель);
//	
//	РезультатЗапроса = Запрос.Выполнить().Выбрать();
//	
//	РезультатЗапроса.Следующий();
//	
//	РодительОбъект.СредняяЗПФакт = РезультатЗапроса.СредняяЗПФакт;
//	РодительОбъект.ОкладФакт = РезультатЗапроса.ОкладФакт;
//	РодительОбъект.МотивацияФакт = РезультатЗапроса.МотивацияФакт;
//	РодительОбъект.СредняяЗППлан = РезультатЗапроса.СредняяЗППлан;
//	РодительОбъект.ОкладПлан = РезультатЗапроса.ОкладПлан;
//	РодительОбъект.МотивацияПлан = РезультатЗапроса.МотивацияПлан;
//	РодительОбъект.НижнийУровеньЗП = РезультатЗапроса.НижнийУровеньЗП;
//	РодительОбъект.СреднийУровеньЗП = РезультатЗапроса.СреднийУровеньЗП;
//	РодительОбъект.ВерхнийУровеньЗП = РезультатЗапроса.ВерхнийУровеньЗП;
//	
//	РодительОбъект.Записать();
//	
//КонецЕсли

КонецПроцедуры
